## Series

Series can be created using -

1. Lists,

2. Numpy Arays and

3. Dictionaries

In [9]:
import numpy as np

In [10]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [8]:
labels

['a', 'b', 'c']

In [9]:
my_data

[10, 20, 30]

In [10]:
arr

array([10, 20, 30])

In [11]:
d

{'a': 10, 'b': 20, 'c': 30}

In [14]:
pd.Series(data = my_data)  # creating series using lists

0    10
1    20
2    30
dtype: int64

In [15]:
# it can also be written as pd.Series(labels, data) but order should be maintained 
# since if we write pd.Series(labels, my_data) we will gat labels first and then the my_list 
pd.Series(index = labels, data = my_data)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(arr)   # creating series using numpy array

0    10
1    20
2    30
dtype: int32

In [21]:
pd.Series(arr, labels)  # note: if we write pd.Series(labels, arr) we will gat labels first and then the array

a    10
b    20
c    30
dtype: int32

In [22]:
pd.Series(d)    # creating series using dictionaries

a    10
b    20
c    30
dtype: int64

Difference between numpy array and panda series -

1. Series can have axis labels i.e. indexed by labels.

2. Series can hold variety of data objects.

In [24]:
pd.Series(data = [print,sum,len]) # note : it can even hold built in functions and have it's references as data points

0    <built-in function print>
1      <built-in function sum>
2      <built-in function len>
dtype: object

Note : If we write label first then arr then label acts as the data point and arr as the index. Hence, the first argument is always the data point(s) followed by the index.

In [5]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])  # we can see clearly why order is important as both ser1 and ser3 are not same
ser1
ser3 = pd.Series(['USA','Germany','USSR','Japan'],[1,2,3,4])
#ser3

In [6]:
ser2 = pd.Series([0,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        0
Germany    2
Italy      5
Japan      4
dtype: int64

In [7]:
ser1['USA']  # here the data type is intrger

1

In [8]:
ser3[2]  # here the data type us object

'Germany'

In [9]:
ser1 / ser2   # the matches which are not found are replaced by nan i.e null

Germany    1.0
Italy      NaN
Japan      1.0
USA        inf
USSR       NaN
dtype: float64

In [10]:
ser1 + ser3

1          NaN
2          NaN
3          NaN
4          NaN
Germany    NaN
Japan      NaN
USA        NaN
USSR       NaN
dtype: object

Note : After operation (eg : +,-,*,/) the integers are replaced by float that happens so that we dont loose any information accidentally

## Dataframes

In [11]:
import numpy as np
import pandas as pd

In [12]:
from numpy.random import randn

In [14]:
np.random.seed(101)     # setting a seed means getting same random no.s

In [16]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])  # data, index, label
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Each of the column i.e W,X,Y,Z are actually a panda's series sharing common index like A. Hence, dataframes are a bunch of series that share an index.

In [18]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [19]:
type(df['W'])

pandas.core.series.Series

In [20]:
df.W  # other way of grabbing column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

The above method is not used very often as it makes pandas confused whether, its a column name or a function if by chance the name of the column and function override. Therefore, to avoid this confusion we generally use the bracket notation for grabbing data from a column.

In [21]:
df[['W','Z']]   # for multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [22]:
df['new'] = df['W'] + df['Z']     # to insert new column

In [23]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [24]:
df.drop('new', axis = 1)   # dropping the column

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

After performing the drop opertion we can see the 'new' column is dropped but on accessing df we get back the whole dataframe including 'new'. This happens because the changes does not occur on the dataframe. Hence, we need to specify an argument called inplace to make the changes occur without loosing any data accidentally.

In [ ]:
df.drop('new',axis = 1,inplace = True)

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.drop('E', axis = 0)  # axis = 0 is optional as it is an default argument

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df.loc['B', 'Y']    # Selecting subsets

-0.8480769834036315

In [35]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [36]:
# conditional operation
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [37]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df['W'] > 0   # condiyional operations on columns/rows

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [39]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Hence, the above shown dataframe does not contain any null values now i.e. only true values are shown.

In [42]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [44]:
# for any particular column
result = df[df['W'] > 0]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
result['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

The above two block of codes shows, how to get only mentioned column as the output. This can be done in one single line of code written below

In [46]:
df[df['W'] > 0]['X']  # answer is same

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [47]:
df[df['W']>0][['X','Y']]# for multiple columns

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In pandas 'and' can only work on simple single instance boolean values not on complex dataframe operations. So, in order to deal with this we use single ampersand or '&'. Similary, in place of 'or' we use pipe operator or ' | '.

In [50]:
df[(df['W'] > 0) & (df ['Y'] > 1)]   # multiple conditions

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[(df['W'] >0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.reset_index()   # index resetting

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [53]:
df   # df will still remain the same, inorder to make changes permanent put inplace = True

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
newind= 'CA NY WY OR CO'.split()

In [55]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [56]:
df['States'] = newind

In [57]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [58]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [59]:
df # inplace for permant changes

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [4]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [5]:
mdf = pd.DataFrame(randn(6,2), hier_index, ['A','B'])
mdf

             A         B
G1 1  0.150230  0.985209
   2 -0.860592 -1.197426
   3  0.179105  1.761538
G2 1 -0.219485 -0.932688
   2  2.216420  0.431958
   3  1.556866  0.509364

As we see can from above, that the dataframe mdf has two levels of index i.e. the G1 and G2 level and then the sub level (1,2,3) and (1,2,3) which constitues to a multi-index dataframe or otherwise known as index hierarchy.

In [6]:
mdf.loc['G1']  # calling data from a multi-level hierarchy

          A         B
1  0.150230  0.985209
2 -0.860592 -1.197426
3  0.179105  1.761538

In [8]:
mdf.loc['G1'].loc[1]

A    0.150230
B    0.985209
Name: 1, dtype: float64

In [12]:
mdf.index.names = ['Groups','Num']   # naming index

In [13]:
mdf

                   A         B
Groups Num
G1     1    0.150230  0.985209
       2   -0.860592 -1.197426
       3    0.179105  1.761538
G2     1   -0.219485 -0.932688
       2    2.216420  0.431958
       3    1.556866  0.509364

In [14]:
mdf.loc['G2'].loc[2]['B']   # grabbing a value from group 2 no. 2 col B

0.43195847410857513

In [18]:
mdf.loc['G1'].loc[2]['A']

-0.8605922038936575

In [21]:
mdf.xs('G1')   # crossection function returns a crossectionof rows and columns from a series/dataframe; used when we multi-level index

            A         B
Num
1    0.150230  0.985209
2   -0.860592 -1.197426
3    0.179105  1.761538

.xs() has the ability to skip or go inside multi-level index; if we want the data of num = 1 from both the groups then, a crossection of G1 and G2 is returned.

In [23]:
mdf.xs(1, level = 'Num')   # grabs the crossection where level is 1

               A         B
Groups
G1      0.150230  0.985209
G2     -0.219485 -0.932688

In [26]:
mdf.xs('G1')

            A         B
Num
1    0.150230  0.985209
2   -0.860592 -1.197426
3    0.179105  1.761538

## Missing Data

In [29]:
import numpy as np
import pandas as pd

In [31]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]} 
# here we ahve keys as are index and data set as data points

In [34]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Dropping missing values

In [36]:
df.dropna()   # it will drop any ROWS with one or more null value(s)

     A    B  C
0  1.0  5.0  1

In [38]:
df.dropna(axis = 1)   # it will delete any COLUMN with null value; axis = 0 by default (which is for rows)

   C
0  1
1  2
2  3

In [40]:
df.dropna(thresh = 2)   # atleast n no. of non null vaues here it is 2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

Filling maissing values

In [42]:
df.fillna(value = 'filled')

        A       B  C
0       1       5  1
1       2  filled  2
2  filled  filled  3

In [44]:
df['A'].fillna(value = df['A'].mean())   # filling nan with col A's mean

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [48]:
df.loc[1].fillna(value = 'filled')   # row 1 havingnan value is replaced by filled

A         2
B    filled
C         2
Name: 1, dtype: object

In [51]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [52]:
df = pd.DataFrame(data)

In [53]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [58]:
bycomp = df.groupby('Company')   # in o/p we get the groupby object where it is stored

In [59]:
bycomp

After this call any aggregate function like mean, sum, etc.

In [61]:
bycomp.mean()    # it gets the aggregate of sales as person col cntains strings

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [62]:
df.groupby('Company').mean()    # in one step

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [64]:
bycomp.mean().loc['FB']    # to access a row

Sales    296.5
Name: FB, dtype: float64

In [66]:
df.groupby('Company').count()   # count no. of instances for column

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

Here, we have person col also since we can count no. of people in the company

In [68]:
df.groupby('Company').max()  # names in dec order

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [70]:
df.groupby('Company').min() # names in asc order

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [74]:
df.groupby('Company').describe()    # gives bunch of useful all at once

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [73]:
df.groupby('Company').describe().transpose()   # want it ow wise

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [76]:
df.groupby('Company').describe().transpose()['FB'] # if we want only one column

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging, Joining and Concaternating

In [2]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [10]:
pd.concat([df1, df2, df3])    # concatenating 3 dataframes together

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [11]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [17]:
left = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B1','B2','B3','B4']})

right = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                      'C':['C0','C1','C2','C3'],
                      'D':['D0','D1','D2','D3']})

In [18]:
left

  Key   A   B
0  K0  A0  B1
1  K1  A1  B2
2  K2  A2  B3
3  K3  A3  B4

In [19]:
right

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [20]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [21]:
pd.merge(left, right, on=['key1', 'key2'])   # merged on the basis of 2 keys

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [22]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [23]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [24]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [30]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                     index =['K0','K1','K2'])
    
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0','K2','K3'])

In [32]:
left.join(right)   # performs inner join over index

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [34]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [35]:
left.join(right, how = 'left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [36]:
left.join(right, how = 'right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

## Operations

In [7]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col2'].unique()     # finding unique values in col2

array([444, 555, 666], dtype=int64)

In [9]:
df['col2'].nunique()     # finding number unique values present in col2

3

In [11]:
df['col2'].value_counts()    # showing unique values along with how many times they occur

444    2
555    1
666    1
Name: col2, dtype: int64

In [16]:
def times2(x):
    return x*2

If we want to apply this custom function to our dataframe we can do it by the help apply method.

In [18]:
df['col1'].apply(times2)   # apply(times2) would broadcast times2 to each element of col1

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

As we use custom functions, similarly we can also use built-in methods.

In [23]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

Note: We cannot apply len() to col1 and col2 because they consists of integer values (error: 'int' has no len()).

Note: apply() is very powerful while using lambda expressions. That way both lines of code and time is saved.

In [24]:
df['col2'].apply(lambda x: x*2)    # using lambda expression

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [26]:
df.drop('col2', axis = 1)    # removing col2 ; if changesare meant to permenant put inplace = True

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [27]:
df.columns    # list of columns are returned

Index(['col1', 'col2', 'col3'], dtype='object')

In [28]:
df.index     # information of index

RangeIndex(start=0, stop=4, step=1)

Both columns and index are actually attributes of dataframes(hence can be accessed as above mentioned)

In [29]:
df.sort_values('col2')     # arranging dataframe in asc order on the basis of col2

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Note : While using sort by column we can observe that the index remains stuck to its respective row, it do not changes. We can change the order of sorting, make it permanent, change the order and also change the kind of sort.

In [30]:
# to find ull values in the dataframe. A dataframe consisting of boolean values is returned
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [31]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [33]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [32]:
df.pivot_table(values = 'D', index = ['A','B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

Creating a pivot table is like creating a multi-index dataframe where values are the datapoints and columns will have all the values of 'C'(mentioned above).

## Data input and output

In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'C:\\Users\\star'

In [3]:
pd.read_csv('example.csv')

FileNotFoundError: [Errno 2] File b'example.csv' does not exist: b'example.csv'